name: "DENSE-SHUFFLE-NET"

layer {
  name: "data"
  type: "Data"

  top: "data"

  include {
    phase: TRAIN
  }

  data_param {
    source: "/media/datavolume3/huijun/CityScapes/cityscapes_lmdb_val/data"
    backend: LMDB
    batch_size: 1
  }

  transform_param {
    scale: 0.00390625         # feature scaling coefficient: this maps the [0, 255] data to [0, 1]
    mean_value: 80.5423       # B
    mean_value: 91.3162       # G
    mean_value: 81.4312       # R
  }
}

layer {
  name: "label"
  type: "Data"

  top: "label"

  include {
    phase: TRAIN
  }

  data_param {
    source: "/media/datavolume3/huijun/CityScapes/cityscapes_lmdb_val/label"
    backend: LMDB
    batch_size: 1
  }
}

# ------------------------------ Net Define ------------------------------ #
# ------------------------------ Pooling 0  1/2
layer {
  name: "conv1"
  type: "Convolution"      # Pooling 1/2

  bottom: "data"
  top: "conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    pad: 3
    stride: 2
    kernel_size: 7

    dilation: 1

    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "conv1/bn"
  type: "BatchNorm"

  bottom: "conv1"
  top: "conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv1/scale"
  type: "Scale"

  bottom: "conv1"
  top: "conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu1"
  type: "ReLU"

  bottom: "conv1"
  top: "conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# --------------------------- Pooling 1  1/4
layer {
    name: "pool2"
    type: "Pooling"

    bottom: "conv1"
    top: "pool2"
    pooling_param {
        kernel_size: 3
        stride: 2
        pool: MAX
    }
}

layer {
  name: "conv2/x0"
  type: "Convolution"

  bottom: "conv1"
  top: "conv2/x0"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    pad: 0
    stride: 1
    kernel_size: 1

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "conv2/x0/bn"
  type: "BatchNorm"

  bottom: "conv2/x0"
  top: "conv2/x0"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2/x0/scale"
  type: "Scale"

  bottom: "conv2/x0"
  top: "conv2/x0"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2/x0"
  type: "ReLU"

  bottom: "conv2/x0"
  top: "conv2/x0"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle2/x0"
  type: "ShuffleChannel"

  bottom: "conv2/x0"
  top: "shuffle2/x0"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv2/x2"
  type: "ConvolutionDepthwise"

  bottom: "shuffle2/x0"
  top: "conv2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    pad: 1
    stride: 2
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "conv2/x2/bn"
  type: "BatchNorm"

  bottom: "conv2/x2"
  top: "conv2/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2/x2/scale"
  type: "Scale"

  bottom: "conv2/x2"
  top: "conv2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv2/x1"
  type: "Convolution"

  bottom: "conv2/x2"
  top: "conv2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    pad: 0
    stride: 1
    kernel_size: 1

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "conv2/x1/bn"
  type: "BatchNorm"

  bottom: "conv2/x1"
  top: "conv2/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2/x1/scale"
  type: "Scale"

  bottom: "conv2/x1"
  top: "conv2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
    name: "pooling2/add"
    type: "Eltwise"

    bottom: "pool2"
    bottom: "conv2/x1"
    top: "pooling2/add"

    eltwise_param {
        operation: SUM
    }
}

layer {
    name: "pool2/relu"
    type: "ReLU"

    bottom: "pooling2/add"
    top: "pooling2/add"

    relu_param {
        negative_slope: 0.10
    }
}

# ------------------------------ Dense Block #1 ----------------------------- #
# ------------------------------ DenseShuffle Unit #1 64+8
layer {
  name: "conv2_1/x1"
  type: "Convolution"

  bottom: "pooling2/add"
  top: "conv2_1/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32      # Down Channel to 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4             # Group Pointwise Convolution

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_1/x1/bn"
  type: "BatchNorm"

  bottom: "conv2_1/x1"
  top: "conv2_1/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_1/x1/scale"
  type: "Scale"

  bottom: "conv2_1/x1"
  top: "conv2_1/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_1/x1"
  type: "ReLU"

  bottom: "conv2_1/x1"
  top: "conv2_1/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle2_1/x1"
  type: "ShuffleChannel"      # Channel Shuffle

  bottom: "conv2_1/x1"
  top: "shuffle2_1/x1"

  shuffle_channel_param {
    group: 4
  }
}


layer {
  name: "conv2_1/x2"
  type: "ConvolutionDepthwise"  # Depthwise Convolution

  bottom: "shuffle2_1/x1"
  top: "conv2_1/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_1/x2/bn"
  type: "BatchNorm"

  bottom: "conv2_1/x2"
  top: "conv2_1/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_1/x2/scale"
  type: "Scale"

  bottom: "conv2_1/x2"
  top: "conv2_1/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "conv2_1/x3"
  type: "Convolution"

  bottom: "conv2_1/x2"
  top: "conv2_1/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 8      # Down Channel to 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    # group: 4             # Group Pointwise Convolution

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_1/x3/bn"
  type: "BatchNorm"

  bottom: "conv2_1/x3"
  top: "conv2_1/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_1/x3/scale"
  type: "Scale"

  bottom: "conv2_1/x3"
  top: "conv2_1/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "concat_2_1"
  type: "Concat"

  bottom: "pooling2/add"
  bottom: "conv2_1/x3"
  top: "concat_2_1"
}
layer {
  name: "relu2_1/x2"
  type: "ReLU"

  bottom: "concat_2_1"
  top: "concat_2_1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #2 64+8+8
layer {
  name: "conv2_2/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "concat_2_1"
  top: "conv2_2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_2/x1/bn"
  type: "BatchNorm"

  bottom: "conv2_2/x1"
  top: "conv2_2/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_2/x1/scale"
  type: "Scale"

  bottom: "conv2_2/x1"
  top: "conv2_2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_2/x1"
  type: "ReLU"

  bottom: "conv2_2/x1"
  top: "conv2_2/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle2_2/x1"
  type: "ShuffleChannel"

  bottom: "conv2_2/x1"
  top: "shuffle2_2/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv2_2/x2"
  type: "ConvolutionDepthwise"   # Depthwise Convolution

  bottom: "shuffle2_2/x1"
  top: "conv2_2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_2/x2/bn"
  type: "BatchNorm"

  bottom: "conv2_2/x2"
  top: "conv2_2/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_2/x2/scale"
  type: "Scale"

  bottom: "conv2_2/x2"
  top: "conv2_2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv2_2/x3"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "conv2_2/x2"
  top: "conv2_2/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    # group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_2/x3/bn"
  type: "BatchNorm"

  bottom: "conv2_2/x3"
  top: "conv2_2/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_2/x3/scale"
  type: "Scale"

  bottom: "conv2_2/x3"
  top: "conv2_2/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "concat_2_2"
  type: "Concat"

  bottom: "concat_2_1"
  bottom: "conv2_2/x3"
  top: "concat_2_2"
}
layer {
  name: "relu2_2/x2"
  type: "ReLU"

  bottom: "concat_2_2"
  top: "concat_2_2"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #3 64+8+8+16
layer {
  name: "conv2_3/x1"
  type: "Convolution"   # Group Pointwise Convolution

  bottom: "concat_2_2"
  top: "conv2_3/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_3/x1/bn"
  type: "BatchNorm"

  bottom: "conv2_3/x1"
  top: "conv2_3/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_3/x1/scale"
  type: "Scale"

  bottom: "conv2_3/x1"
  top: "conv2_3/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_3/x1"
  type: "ReLU"

  bottom: "conv2_3/x1"
  top: "conv2_3/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle2_3/x1"
  type: "ShuffleChannel"  # Shuffle Channel

  bottom: "conv2_3/x1"
  top: "shuffle2_3/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv2_3/x2"
  type: "ConvolutionDepthwise"   # Depthwise Convolution

  bottom: "shuffle2_3/x1"
  top: "conv2_3/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_3/x2/bn"
  type: "BatchNorm"

  bottom: "conv2_3/x2"
  top: "conv2_3/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_3/x2/scale"
  type: "Scale"

  bottom: "conv2_3/x2"
  top: "conv2_3/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv2_3/x3"
  type: "Convolution"   # Group Pointwise Convolution

  bottom: "conv2_3/x2"
  top: "conv2_3/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 16

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_3/x3/bn"
  type: "BatchNorm"

  bottom: "conv2_3/x3"
  top: "conv2_3/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_3/x3/scale"
  type: "Scale"

  bottom: "conv2_3/x3"
  top: "conv2_3/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "concat_2_3"
  type: "Concat"

  bottom: "concat_2_2"
  bottom: "conv2_3/x3"
  top: "concat_2_3"
}
layer {
  name: "relu2_3/x2"
  type: "ReLU"

  bottom: "concat_2_3"
  top: "concat_2_3"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit # 4 64+8+8+16+32
layer {
  name: "conv2_4/x1"
  type: "Convolution"

  bottom: "concat_2_3"
  top: "conv2_4/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_4/x1/bn"
  type: "BatchNorm"

  bottom: "conv2_4/x1"
  top: "conv2_4/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_4/x1/scale"
  type: "Scale"

  bottom: "conv2_4/x1"
  top: "conv2_4/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2_4/x1"
  type: "ReLU"

  bottom: "conv2_4/x1"
  top: "conv2_4/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle2_4/x1"
  type: "ShuffleChannel"    # Shuffle Channel

  bottom: "conv2_4/x1"
  top: "shuffle2_4/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv2_4/x2"
  type: "ConvolutionDepthwise"    # Depthwise Convolution

  bottom: "shuffle2_4/x1"
  top: "conv2_4/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_4/x2/bn"
  type: "BatchNorm"

  bottom: "conv2_4/x2"
  top: "conv2_4/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_4/x2/scale"
  type: "Scale"

  bottom: "conv2_4/x2"
  top: "conv2_4/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "conv2_4/x3"
  type: "Convolution"

  bottom: "conv2_4/x2"
  top: "conv2_4/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_4/x3/bn"
  type: "BatchNorm"

  bottom: "conv2_4/x3"
  top: "conv2_4/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_4/x3/scale"
  type: "Scale"

  bottom: "conv2_4/x3"
  top: "conv2_4/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "drop1"
  type: "Dropout"
  bottom: "conv2_4/x3"
  top: "conv2_4/x3"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  name: "concat_2_4"
  type: "Concat"

  bottom: "concat_2_3"
  bottom: "conv2_4/x3"
  top: "concat_2_4"
}
layer {
  name: "relu2_4/x2"
  type: "ReLU"

  bottom: "concat_2_4"
  top: "concat_2_4"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ Pooling #2  1/8  128
layer {
    name: "pool3"
    type: "Pooling"

    bottom: "concat_2_4"
    top: "pool3"
    pooling_param {
        kernel_size: 3
        stride: 2
        pool: MAX
    }
}

layer {
  name: "conv2_blk/x1"
  type: "Convolution"

  bottom: "concat_2_4"
  top: "conv2_blk/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 256

    bias_term: false

    kernel_size: 1
    stride: 1
    pad: 0

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_blk/x1/bn"
  type: "BatchNorm"

  bottom: "conv2_blk/x1"
  top: "conv2_blk/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_blk/x1/scale"
  type: "Scale"

  bottom: "conv2_blk/x1"
  top: "conv2_blk/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_blk/x1/relu"
  type: "ReLU"

  bottom: "conv2_blk/x1"
  top: "conv2_blk/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle3/x1"
  type: "ShuffleChannel"

  bottom: "conv2_blk/x1"
  top: "shuffle3/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv2_blk"
  type: "ConvolutionDepthwise"

  bottom: "shuffle3/x1"
  top: "conv2_blk"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 256

    bias_term: false
    kernel_size: 3
    stride: 2
    pad: 1

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_blk/bn"
  type: "BatchNorm"

  bottom: "conv2_blk"
  top: "conv2_blk"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_blk/scale"
  type: "Scale"

  bottom: "conv2_blk"
  top: "conv2_blk"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv2_blk/x0"
  type: "Convolution"

  bottom: "conv2_blk"
  top: "conv2_blk/x0"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    bias_term: false

    kernel_size: 1
    stride: 1
    pad: 0

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv2_blk/x0/bn"
  type: "BatchNorm"

  bottom: "conv2_blk/x0"
  top: "conv2_blk/x0"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv2_blk/x0/scale"
  type: "Scale"

  bottom: "conv2_blk/x0"
  top: "conv2_blk/x0"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
    name: "pooling3/add"
    type: "Eltwise"

    bottom: "pool3"
    bottom: "conv2_blk/x0"
    top: "pooling3/add"

    eltwise_param {
        operation: SUM
    }

}

layer {
    name: "pool3/relu"
    type: "ReLU"

    bottom: "pooling3/add"
    top: "pooling3/add"

    relu_param {
        negative_slope: 0.10
    }
}

# ------------------------------ Dense Block #2 ----------------------------- #
# ------------------------------ DenseShuffle Unit #1 128+8
layer {
  name: "conv3_1/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "pooling3/add"
  top: "conv3_1/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_1/x1/bn"
  type: "BatchNorm"

  bottom: "conv3_1/x1"
  top: "conv3_1/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_1/x1/scale"
  type: "Scale"

  bottom: "conv3_1/x1"
  top: "conv3_1/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_1/x1"
  type: "ReLU"

  bottom: "conv3_1/x1"
  top: "conv3_1/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle3_1/x1"
  type: "ShuffleChannel"  # Shuffle Channel

  bottom: "conv3_1/x1"
  top: "shuffle3_1/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv3_1/x2"
  type: "ConvolutionDepthwise"  # Depthwise Convolution

  bottom: "shuffle3_1/x1"
  top: "conv3_1/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_1/x2/bn"
  type: "BatchNorm"

  bottom: "conv3_1/x2"
  top: "conv3_1/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_1/x2/scale"
  type: "Scale"

  bottom: "conv3_1/x2"
  top: "conv3_1/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv3_1/x3"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "conv3_1/x2"
  top: "conv3_1/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    # group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_1/x3/bn"
  type: "BatchNorm"

  bottom: "conv3_1/x3"
  top: "conv3_1/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_1/x3/scale"
  type: "Scale"

  bottom: "conv3_1/x3"
  top: "conv3_1/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "concat_3_1"
  type: "Concat"

  bottom: "pooling3/add"
  bottom: "conv3_1/x3"
  top: "concat_3_1"
}
layer {
  name: "relu3_1/x2"
  type: "ReLU"

  bottom: "concat_3_1"
  top: "concat_3_1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #2 128+8+8
layer {
  name: "conv3_2/x1"
  type: "Convolution"

  bottom: "concat_3_1"
  top: "conv3_2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_2/x1/bn"
  type: "BatchNorm"

  bottom: "conv3_2/x1"
  top: "conv3_2/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_2/x1/scale"
  type: "Scale"

  bottom: "conv3_2/x1"
  top: "conv3_2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_2/x1"
  type: "ReLU"

  bottom: "conv3_2/x1"
  top: "conv3_2/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle3_2/x1"
  type: "ShuffleChannel"  # Shuffle Channel

  bottom: "conv3_2/x1"
  top: "shuffle3_2/x1"

  shuffle_channel_param {
    group: 4
  }
}


layer {
  name: "conv3_2/x2"
  type: "ConvolutionDepthwise"    # Depthwise Convolution

  bottom: "shuffle3_2/x1"
  top: "conv3_2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_2/x2/bn"
  type: "BatchNorm"

  bottom: "conv3_2/x2"
  top: "conv3_2/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_2/x2/scale"
  type: "Scale"

  bottom: "conv3_2/x2"
  top: "conv3_2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "conv3_2/x3"
  type: "Convolution"

  bottom: "conv3_2/x2"
  top: "conv3_2/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    # group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_2/x3/bn"
  type: "BatchNorm"

  bottom: "conv3_2/x3"
  top: "conv3_2/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_2/x3/scale"
  type: "Scale"

  bottom: "conv3_2/x3"
  top: "conv3_2/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "concat_3_2"
  type: "Concat"

  bottom: "concat_3_1"
  bottom: "conv3_2/x3"
  top: "concat_3_2"
}
layer {
  name: "relu3_2/x2"
  type: "ReLU"

  bottom: "concat_3_2"
  top: "concat_3_2"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #3 128+8+8+16
layer {
  name: "conv3_3/x1"
  type: "Convolution"  # Group Pointwise Convolution

  bottom: "concat_3_2"
  top: "conv3_3/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_3/x1/bn"
  type: "BatchNorm"

  bottom: "conv3_3/x1"
  top: "conv3_3/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_3/x1/scale"
  type: "Scale"

  bottom: "conv3_3/x1"
  top: "conv3_3/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_3/x1"
  type: "ReLU"

  bottom: "conv3_3/x1"
  top: "conv3_3/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle3_3/x1"
  type: "ShuffleChannel"

  bottom: "conv3_3/x1"
  top: "shuffle3_3/x1"

  shuffle_channel_param {
    group: 4
  }
}


layer {
  name: "conv3_3/x2"
  type: "ConvolutionDepthwise"  # Depthwise Convolution

  bottom: "shuffle3_3/x1"
  top: "conv3_3/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_3/x2/bn"
  type: "BatchNorm"

  bottom: "conv3_3/x2"
  top: "conv3_3/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_3/x2/scale"
  type: "Scale"

  bottom: "conv3_3/x2"
  top: "conv3_3/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv3_3/x3"
  type: "Convolution"  # Group Pointwise Convolution

  bottom: "conv3_3/x2"
  top: "conv3_3/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 16

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_3/x3/bn"
  type: "BatchNorm"

  bottom: "conv3_3/x3"
  top: "conv3_3/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_3/x3/scale"
  type: "Scale"

  bottom: "conv3_3/x3"
  top: "conv3_3/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "concat_3_3"
  type: "Concat"

  bottom: "concat_3_2"
  bottom: "conv3_3/x3"
  top: "concat_3_3"
}
layer {
  name: "relu3_3/x2"
  type: "ReLU"

  bottom: "concat_3_3"
  top: "concat_3_3"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #4 128+8+8+16+32
layer {
  name: "conv3_4/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "concat_3_3"
  top: "conv3_4/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_4/x1/bn"
  type: "BatchNorm"

  bottom: "conv3_4/x1"
  top: "conv3_4/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_4/x1/scale"
  type: "Scale"

  bottom: "conv3_4/x1"
  top: "conv3_4/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_4/x1"
  type: "ReLU"

  bottom: "conv3_4/x1"
  top: "conv3_4/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle3_4/x1"
  type: "ShuffleChannel"

  bottom: "conv3_4/x1"
  top: "shuffle3_4/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv3_4/x2"
  type: "ConvolutionDepthwise"

  bottom: "shuffle3_4/x1"
  top: "conv3_4/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 128

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_4/x2/bn"
  type: "BatchNorm"

  bottom: "conv3_4/x2"
  top: "conv3_4/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_4/x2/scale"
  type: "Scale"

  bottom: "conv3_4/x2"
  top: "conv3_4/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv3_4/x3"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "conv3_4/x2"
  top: "conv3_4/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_4/x3/bn"
  type: "BatchNorm"

  bottom: "conv3_4/x3"
  top: "conv3_4/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_4/x3/scale"
  type: "Scale"

  bottom: "conv3_4/x3"
  top: "conv3_4/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "concat_3_4"
  type: "Concat"

  bottom: "concat_3_3"
  bottom: "conv3_4/x3"
  top: "concat_3_4"
}
layer {
  name: "relu3_4/x2"
  type: "ReLU"

  bottom: "concat_3_4"
  top: "concat_3_4"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit # 128+8+8+16+32+64
layer {
  name: "conv3_5/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "concat_3_4"
  top: "conv3_5/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 256

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_5/x1/bn"
  type: "BatchNorm"

  bottom: "conv3_5/x1"
  top: "conv3_5/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_5/x1/scale"
  type: "Scale"

  bottom: "conv3_5/x1"
  top: "conv3_5/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3_5/x1"
  type: "ReLU"

  bottom: "conv3_5/x1"
  top: "conv3_5/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle3_5/x1"
  type: "ShuffleChannel"

  bottom: "conv3_5/x1"
  top: "shuffle3_5/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv3_5/x2"
  type: "ConvolutionDepthwise"    # Depthwise Convolution

  bottom: "shuffle3_5/x1"
  top: "conv3_5/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 256

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_5/x2/bn"
  type: "BatchNorm"

  bottom: "conv3_5/x2"
  top: "conv3_5/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_5/x2/scale"
  type: "Scale"

  bottom: "conv3_5/x2"
  top: "conv3_5/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv3_5/x3"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "conv3_5/x2"
  top: "conv3_5/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_5/x3/bn"
  type: "BatchNorm"

  bottom: "conv3_5/x3"
  top: "conv3_5/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_5/x3/scale"
  type: "Scale"

  bottom: "conv3_5/x3"
  top: "conv3_5/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "drop2"
  type: "Dropout"
  bottom: "conv3_5/x3"
  top: "conv3_5/x3"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  name: "concat_3_5"
  type: "Concat"

  bottom: "concat_3_4"
  bottom: "conv3_5/x3"
  top: "concat_3_5"
}
layer {
  name: "relu3_5/x3"
  type: "ReLU"

  bottom: "concat_3_5"
  top: "concat_3_5"

  relu_param {
    negative_slope: 0.10
  }
}

# ---------------------------- Pooling #3  256  1/16
layer {
    name: "pool4"
    type: "Pooling"

    bottom: "concat_3_5"
    top: "pool4"
    pooling_param {
        kernel_size: 3
        stride: 2
        pool: MAX
    }
}

layer {
  name: "conv3_blk/x1"
  type: "Convolution"

  bottom: "concat_3_5"
  top: "conv3_blk/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 512

    bias_term: false

    kernel_size: 1
    stride: 1
    pad: 0

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_blk/x1/bn"
  type: "BatchNorm"

  bottom: "conv3_blk/x1"
  top: "conv3_blk/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_blk/x1/scale"
  type: "Scale"

  bottom: "conv3_blk/x1"
  top: "conv3_blk/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_blk/x1/relu"
  type: "ReLU"

  bottom: "conv3_blk/x1"
  top: "conv3_blk/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle4/x1"
  type: "ShuffleChannel"

  bottom: "conv3_blk/x1"
  top: "shuffle4/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv3_blk"
  type: "ConvolutionDepthwise"

  bottom: "shuffle4/x1"
  top: "conv3_blk"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 512

    bias_term: false
    kernel_size: 3
    stride: 2
    pad: 1

    dilation: 1

     weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_blk/bn"
  type: "BatchNorm"

  bottom: "conv3_blk"
  top: "conv3_blk"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_blk/scale"
  type: "Scale"

  bottom: "conv3_blk"
  top: "conv3_blk"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv3_blk/x0"
  type: "Convolution"

  bottom: "conv3_blk"
  top: "conv3_blk/x0"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 256

    bias_term: false

    kernel_size: 1
    stride: 1
    pad: 0

    group: 4

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv3_blk/x0/bn"
  type: "BatchNorm"

  bottom: "conv3_blk/x0"
  top: "conv3_blk/x0"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv3_blk/x0/scale"
  type: "Scale"

  bottom: "conv3_blk/x0"
  top: "conv3_blk/x0"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
    name: "pooling4/add"
    type: "Eltwise"

    bottom: "pool4"
    bottom: "conv3_blk/x0"
    top: "pooling4/add"

    eltwise_param {
        operation: SUM
    }
}

layer {
    name: "pool4/relu"
    type: "ReLU"

    bottom: "pooling4/add"
    top: "pooling4/add"

    relu_param {
        negative_slope: 0.10
    }
}

# ------------------------------ Dense Block #4 ----------------------------- #
# ------------------------------ DenseShuffle Unit #1 256+8
layer {
  name: "conv4_1/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "pooling4/add"
  top: "conv4_1/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_1/x1/bn"
  type: "BatchNorm"

  bottom: "conv4_1/x1"
  top: "conv4_1/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_1/x1/scale"
  type: "Scale"

  bottom: "conv4_1/x1"
  top: "conv4_1/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_1/x1"
  type: "ReLU"

  bottom: "conv4_1/x1"
  top: "conv4_1/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle4_1/x1"
  type: "ShuffleChannel"  # Shuffle Channel

  bottom: "conv4_1/x1"
  top: "shuffle4_1/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv4_1/x2"
  type: "ConvolutionDepthwise"    # Depthwise Convolution

  bottom: "shuffle4_1/x1"
  top: "conv4_1/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_1/x2/bn"
  type: "BatchNorm"

  bottom: "conv4_1/x2"
  top: "conv4_1/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_1/x2/scale"
  type: "Scale"

  bottom: "conv4_1/x2"
  top: "conv4_1/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv4_1/x3"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "conv4_1/x2"
  top: "conv4_1/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    # group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_1/x3/bn"
  type: "BatchNorm"

  bottom: "conv4_1/x3"
  top: "conv4_1/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_1/x3/scale"
  type: "Scale"

  bottom: "conv4_1/x3"
  top: "conv4_1/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "concat_4_1"
  type: "Concat"

  bottom: "pooling4/add"
  bottom: "conv4_1/x3"
  top: "concat_4_1"
}
layer {
  name: "relu4_1/x2"
  type: "ReLU"

  bottom: "concat_4_1"
  top: "concat_4_1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #2
layer {
  name: "conv4_2/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "concat_4_1"
  top: "conv4_2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_2/x1/bn"
  type: "BatchNorm"

  bottom: "conv4_2/x1"
  top: "conv4_2/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_2/x1/scale"
  type: "Scale"

  bottom: "conv4_2/x1"
  top: "conv4_2/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4_2/x1"
  type: "ReLU"

  bottom: "conv4_2/x1"
  top: "conv4_2/x1"

  relu_param {
    negative_slope: 0.10
  }
}
layer {
  name: "shuffle4_2/x1"
  type: "ShuffleChannel"  # Shuffle Channel

  bottom: "conv4_2/x1"
  top: "shuffle4_2/x1"

  shuffle_channel_param {
    group: 4
  }
}

layer {
  name: "conv4_2/x2"
  type: "ConvolutionDepthwise"

  bottom: "shuffle4_2/x1"
  top: "conv4_2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 32

    bias_term: false
    pad: 1
    stride: 1
    kernel_size: 3

    dilation: 1

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_2/x2/bn"
  type: "BatchNorm"

  bottom: "conv4_2/x2"
  top: "conv4_2/x2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_2/x2/scale"
  type: "Scale"

  bottom: "conv4_2/x2"
  top: "conv4_2/x2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "conv4_2/x3"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "conv4_2/x2"
  top: "conv4_2/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 8

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    # group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_2/x3/bn"
  type: "BatchNorm"

  bottom: "conv4_2/x3"
  top: "conv4_2/x3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_2/x3/scale"
  type: "Scale"

  bottom: "conv4_2/x3"
  top: "conv4_2/x3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "concat_4_2"
  type: "Concat"

  bottom: "concat_4_1"
  bottom: "conv4_2/x3"
  top: "concat_4_2"
}
layer {
  name: "relu4_2/x2"
  type: "ReLU"

  bottom: "concat_4_2"
  top: "concat_4_2"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------------ DenseShuffle Unit #3 256+8+8+16
layer {
  name: "conv4_3/x1"
  type: "Convolution"    # Group Pointwise Convolution

  bottom: "concat_4_2"
  top: "conv4_3/x1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    bias_term: false
    kernel_size: 1
    stride: 1
    pad: 0

    dilation: 1

    group: 4

    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "conv4_3/x1/bn"
  type: "BatchNorm"

  bottom: "conv4_3/x1"
  top: "conv4_3/x1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "conv4_3/x1/scale"
  type: "Scale"

  bottom: "conv4_3/x1"
  top: "conv4_3/x1"

  param {
