name: "SE-DPShuffleNet"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 384
input_dim: 768

# ------------------------------ Net Define ------------------------------ #
#################### conv1 ####################
layer {
  name: "conv1"
  type: "Convolution"

  bottom: "data"
  top: "conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 64

    kernel_size: 7
    pad: 3
    stride: 2
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"

  bottom: "conv1"
  top: "conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_scale"
  type: "Scale"

  bottom: "conv1"
  top: "conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"

  bottom: "conv1"
  top: "conv1"

  relu_param {
    negative_slope: 0.10
  }
}


#################### pooling ####################
layer {
  name: "pool1"
  type: "Pooling"

  bottom: "conv1"
  top: "pool1"

  pooling_param {
    pool: MAX

    kernel_size: 3
    stride: 2
  }
}


#################### dpn1 ####################
layer {
  name: "dpn1_match_conv"
  type: "Convolution"

  bottom: "pool1"
  top: "dpn1_match_conv"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 160    # 128/32

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn1_match_bn"
  type: "BatchNorm"

  bottom: "dpn1_match_conv"
  top: "dpn1_match_conv"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn1_match_scale"
  type: "Scale"

  bottom: "dpn1_match_conv"
  top: "dpn1_match_conv"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn1_match_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn1_match_conv"
  top: "dpn1_match_conv"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End


layer {
  name: "dpn1_match_conv_Slice"
  type: "Slice"

  bottom: "dpn1_match_conv"
  top: "dpn1_match_conv_split1"  # 0~127
  top: "dpn1_match_conv_split2"  # 128~160  32

  slice_param {
    axis: 1     # channel wise
    slice_point: 128
  }
}


layer {
  name: "dpn1_conv1"
  type: "Convolution"

  bottom: "pool1"
  top: "dpn1_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    pad: 0
    stride: 1
    kernel_size: 1
    # dilation: 1

    group: 8
    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "dpn1_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn1_conv1"
  top: "dpn1_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn1_conv1_scale"
  type: "Scale"

  bottom: "dpn1_conv1"
  top: "dpn1_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn1_conv1_relu"
  type: "ReLU"

  bottom: "dpn1_conv1"
  top: "dpn1_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn1_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn1_conv1"
  top: "dpn1_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn1_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn1_conv1"
  top: "dpn1_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "dpn1_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn1_conv2"
  top: "dpn1_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn1_conv2_scale"
  type: "Scale"

  bottom: "dpn1_conv2"
  top: "dpn1_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn1_conv3"
  type: "Convolution"

  bottom: "dpn1_conv2"
  top: "dpn1_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 144    # 128/16

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    group: 8

    weight_filler {
      type: "msra"
    }
    bias_term: false
  }
}
layer {
  name: "dpn1_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn1_conv3"
  top: "dpn1_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn1_conv3_scale"
  type: "Scale"

  bottom: "dpn1_conv3"
  top: "dpn1_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
# ------------------------- Channel Shuffle Start
layer {
  name: "dpn1_shuffle2"
  type: "ShuffleChannel"

  bottom: "dpn1_conv3"
  top: "dpn1_conv3"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End


layer {
  name: "dpn1_conv3_Slice"
  type: "Slice"

  bottom: "dpn1_conv3"
  top: "dpn1_conv3_split1"  # 0~127
  top: "dpn1_conv3_split2"  # 128~143

  slice_param {
    axis: 1
    slice_point: 128
  }
}


layer {
  name: "dpn1_elewise"
  type: "Eltwise"

  bottom: "dpn1_match_conv_split1"
  bottom: "dpn1_conv3_split1"
  top: "dpn1_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn1_elewise_relu"
  type: "ReLU"

  bottom: "dpn1_elewise"
  top: "dpn1_elewise"

  relu_param {
    negative_slope: 0.10
  }
}

layer {
  name: "dpn1_concat"
  type: "Concat"

  bottom: "dpn1_match_conv_split2"
  bottom: "dpn1_conv3_split2"
  top: "dpn1_concat"
}
layer {
  name: "dpn1_concat_relu"
  type: "ReLU"

  bottom: "dpn1_concat"
  top: "dpn1_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn2 ####################
layer {
  name: "dpn2_concat_input"
  type: "Concat"

  bottom: "dpn1_elewise"
  bottom: "dpn1_concat"
  top: "dpn2_concat_input"
}


layer {
  name: "dpn2_conv1"
  type: "Convolution"

  bottom: "dpn2_concat_input"
  top: "dpn2_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn2_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn2_conv1"
  top: "dpn2_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn2_conv1_scale"
  type: "Scale"

  bottom: "dpn2_conv1"
  top: "dpn2_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn2_conv1_relu"
  type: "ReLU"

  bottom: "dpn2_conv1"
  top: "dpn2_conv1"

  relu_param {
    negative_slope: 0.10
  }
}
# ------------------------- Channel Shuffle Start
layer {
  name: "dpn2_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn2_conv1"
  top: "dpn2_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End


layer {
  name: "dpn2_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn2_conv1"
  top: "dpn2_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn2_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn2_conv2"
  top: "dpn2_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn2_conv2_scale"
  type: "Scale"

  bottom: "dpn2_conv2"
  top: "dpn2_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn2_conv3"
  type: "Convolution"

  bottom: "dpn2_conv2"
  top: "dpn2_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 144

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn2_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn2_conv3"
  top: "dpn2_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn2_conv3_scale"
  type: "Scale"

  bottom: "dpn2_conv3"
  top: "dpn2_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn2_conv3_Slice"
  type: "Slice"

  bottom: "dpn2_conv3"
  top: "dpn2_conv3_split1"  # 0~127
  top: "dpn2_conv3_split2"  # 128~144

  slice_param {
    axis: 1
    slice_point: 128
  }
}


layer {
  name: "dpn2_elewise"
  type: "Eltwise"

  bottom: "dpn1_elewise"
  bottom: "dpn2_conv3_split1"
  top: "dpn2_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn2_elewise_relu"
  type: "ReLU"

  bottom: "dpn2_elewise"
  top: "dpn2_elewise"

  relu_param {
    negative_slope: 0.10
  }
}

layer {
  name: "dpn2_concat"
  type: "Concat"

  bottom: "dpn1_concat"
  bottom: "dpn2_conv3_split2"
  top: "dpn2_concat"
}
layer {
  name: "dpn2_concat_relu"
  type: "ReLU"

  bottom: "dpn2_concat"
  top: "dpn2_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn3 ####################
layer {
  name: "dpn3_concat_input"
  type: "Concat"

  bottom: "dpn2_elewise"
  bottom: "dpn2_concat"
  top: "dpn3_concat_input"
}


layer {
  name: "dpn3_conv1"
  type: "Convolution"

  bottom: "dpn3_concat_input"
  top: "dpn3_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn3_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn3_conv1"
  top: "dpn3_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn3_conv1_scale"
  type: "Scale"

  bottom: "dpn3_conv1"
  top: "dpn3_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn3_conv1_relu"
  type: "ReLU"

  bottom: "dpn3_conv1"
  top: "dpn3_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn3_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn3_conv1"
  top: "dpn3_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn3_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn3_conv1"
  top: "dpn3_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn3_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn3_conv2"
  top: "dpn3_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn3_conv2_scale"
  type: "Scale"

  bottom: "dpn3_conv2"
  top: "dpn3_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn3_conv3"
  type: "Convolution"

  bottom: "dpn3_conv2"
  top: "dpn3_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 144

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn3_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn3_conv3"
  top: "dpn3_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn3_conv3_scale"
  type: "Scale"

  bottom: "dpn3_conv3"
  top: "dpn3_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn3_conv3_Slice"
  type: "Slice"

  bottom: "dpn3_conv3"
  top: "dpn3_conv3_split1"  # 0~127
  top: "dpn3_conv3_split2"  # 128~144

  slice_param {
    axis: 1
    slice_point: 128
  }
}


layer {
  name: "dpn3_elewise"
  type: "Eltwise"

  bottom: "dpn2_elewise"
  bottom: "dpn3_conv3_split1"
  top: "dpn3_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn3_elewise_relu"
  type: "ReLU"

  bottom: "dpn3_elewise"
  top: "dpn3_elewise"

  relu_param {
    negative_slope: 0.10
  }
}


layer {
  name: "dpn3_concat"
  type: "Concat"

  bottom: "dpn2_concat"
  bottom: "dpn3_conv3_split2"
  top: "dpn3_concat"
}
layer {
  name: "dpn3_concat_relu"
  type: "ReLU"

  bottom: "dpn3_concat"
  top: "dpn3_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn4 ####################
layer {
  name: "dpn4_concat_input"
  type: "Concat"

  bottom: "dpn3_elewise"
  bottom: "dpn3_concat"
  top: "dpn4_concat_input"
}


layer {
  name: "dpn4_conv1"
  type: "Convolution"

  bottom: "dpn4_concat_input"
  top: "dpn4_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn4_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn4_conv1"
  top: "dpn4_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn4_conv1_scale"
  type: "Scale"

  bottom: "dpn4_conv1"
  top: "dpn4_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn4_conv1_relu"
  type: "ReLU"

  bottom: "dpn4_conv1"
  top: "dpn4_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn4_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn4_conv1"
  top: "dpn4_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn4_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn4_conv1"
  top: "dpn4_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 72

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn4_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn4_conv2"
  top: "dpn4_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn4_conv2_scale"
  type: "Scale"

  bottom: "dpn4_conv2"
  top: "dpn4_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn4_conv3"
  type: "Convolution"

  bottom: "dpn4_conv2"
  top: "dpn4_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 144

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn4_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn4_conv3"
  top: "dpn4_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn4_conv3_scale"
  type: "Scale"

  bottom: "dpn4_conv3"
  top: "dpn4_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn4_conv3_Slice"
  type: "Slice"

  bottom: "dpn4_conv3"
  top: "dpn4_conv3_split1"  # 0~127
  top: "dpn4_conv3_split2"  # 128~144

  slice_param {
    axis: 1
    slice_point: 128
  }
}


layer {
  name: "dpn4_elewise"
  type: "Eltwise"

  bottom: "dpn3_elewise"
  bottom: "dpn4_conv3_split1"
  top: "dpn4_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn4_elewise_relu"
  type: "ReLU"

  bottom: "dpn4_elewise"
  top: "dpn4_elewise"

  relu_param {
    negative_slope: 0.10
  }
}


layer {
  name: "dpn4_concat"
  type: "Concat"

  bottom: "dpn3_concat"
  bottom: "dpn4_conv3_split2"
  top: "dpn4_concat"
}
layer {
  name: "dpn4_concat_relu"
  type: "ReLU"

  bottom: "dpn4_concat"
  top: "dpn4_concat"

  relu_param {
    negative_slope: 0.10
  }
}

###########################################################################################
#################### dpn5 ####################
###########################################################################################
layer {
  name: "dpn5_concat_input"
  type: "Concat"

  bottom: "dpn4_elewise"
  bottom: "dpn4_concat"
  top: "dpn5_concat_input"
}


layer {
  name: "dpn5_match_conv"
  type: "Convolution"

  bottom: "dpn5_concat_input"
  top: "dpn5_match_conv"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 288

    kernel_size: 1
    pad: 0
    stride: 2
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn5_match_bn"
  type: "BatchNorm"

  bottom: "dpn5_match_conv"
  top: "dpn5_match_conv"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn5_match_scale"
  type: "Scale"

  bottom: "dpn5_match_conv"
  top: "dpn5_match_conv"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


# ------------------------- Channel Shuffle Start
layer {
  name: "dpn5_match_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn5_match_conv"
  top: "dpn5_match_conv"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End


layer {
  name: "dpn5_match_conv_Slice"
  type: "Slice"

  bottom: "dpn5_match_conv"
  top: "dpn5_match_conv_split1"  # 0~255
  top: "dpn5_match_conv_split2"  # 256~287

  slice_param {
    axis: 1
    slice_point: 256
  }
}


layer {
  name: "dpn5_conv1"
  type: "Convolution"

  bottom: "dpn5_concat_input"
  top: "dpn5_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn5_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn5_conv1"
  top: "dpn5_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn5_conv1_scale"
  type: "Scale"

  bottom: "dpn5_conv1"
  top: "dpn5_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn5_conv1_relu"
  type: "ReLU"

  bottom: "dpn5_conv1"
  top: "dpn5_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn5_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn5_conv1"
  top: "dpn5_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn5_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn5_conv1"
  top: "dpn5_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 2
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn5_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn5_conv2"
  top: "dpn5_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn5_conv2_scale"
  type: "Scale"

  bottom: "dpn5_conv2"
  top: "dpn5_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn5_conv3"
  type: "Convolution"

  bottom: "dpn5_conv2"
  top: "dpn5_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn5_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn5_conv3"
  top: "dpn5_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn5_conv3_scale"
  type: "Scale"

  bottom: "dpn5_conv3"
  top: "dpn5_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
# ------------------------- Channel Shuffle Start
layer {
  name: "dpn5_shuffle2"
  type: "ShuffleChannel"

  bottom: "dpn5_conv3"
  top: "dpn5_conv3"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End


layer {
  name: "dpn5_conv3_Slice"
  type: "Slice"

  bottom: "dpn5_conv3"
  top: "dpn5_conv3_split1"  # 0~254
  top: "dpn5_conv3_split2"  # 255~271

  slice_param {
    axis: 1
    slice_point: 256
  }
}


layer {
  name: "dpn5_elewise"
  type: "Eltwise"

  bottom: "dpn5_match_conv_split1"
  bottom: "dpn5_conv3_split1"

  top: "dpn5_elewise"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn5_elewise_relu"
  type: "ReLU"

  bottom: "dpn5_elewise"
  top: "dpn5_elewise"

  relu_param {
    negative_slope: 0.10
  }
}


layer {
  name: "dpn5_concat"
  type: "Concat"

  bottom: "dpn5_match_conv_split2"
  bottom: "dpn5_conv3_split2"
  top: "dpn5_concat"
}
layer {
  name: "dpn5_concat_relu"
  type: "ReLU"

  bottom: "dpn5_concat"
  top: "dpn5_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn6 ####################
layer {
  name: "dpn6_concat_input"
  type: "Concat"

  bottom: "dpn5_elewise"
  bottom: "dpn5_concat"
  top: "dpn6_concat_input"
}


layer {
  name: "dpn6_conv1"
  type: "Convolution"

  bottom: "dpn6_concat_input"
  top: "dpn6_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn6_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn6_conv1"
  top: "dpn6_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn6_conv1_scale"
  type: "Scale"

  bottom: "dpn6_conv1"
  top: "dpn6_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn6_conv1_relu"
  type: "ReLU"

  bottom: "dpn6_conv1"
  top: "dpn6_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn6_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn6_conv1"
  top: "dpn6_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn6_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn6_conv1"
  top: "dpn6_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn6_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn6_conv2"
  top: "dpn6_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn6_conv2_scale"
  type: "Scale"

  bottom: "dpn6_conv2"
  top: "dpn6_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn6_conv3"
  type: "Convolution"

  bottom: "dpn6_conv2"
  top: "dpn6_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
	num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn6_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn6_conv3"
  top: "dpn6_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn6_conv3_scale"
  type: "Scale"

  bottom: "dpn6_conv3"
  top: "dpn6_conv3"

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn6_conv3_Slice"
  type: "Slice"

  bottom: "dpn6_conv3"
  top: "dpn6_conv3_split1"  # 0~255
  top: "dpn6_conv3_split2"  # 256~271

  slice_param {
    axis: 1
    slice_point: 256
  }
}


layer {
  name: "dpn6_elewise"
  type: "Eltwise"

  bottom: "dpn5_elewise"
  bottom: "dpn6_conv3_split1"
  top: "dpn6_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn6_elewise_relu"
  type: "ReLU"

  bottom: "dpn6_elewise"
  top: "dpn6_elewise"

  relu_param {
    negative_slope: 0.10
  }
}


layer {
  name: "dpn6_concat"
  type: "Concat"

  bottom: "dpn5_concat"
  bottom: "dpn6_conv3_split2"
  top: "dpn6_concat"
}
layer {
  name: "dpn6_concat_relu"
  type: "ReLU"

  bottom: "dpn6_concat"
  top: "dpn6_concat"

  relu_param {
    negative_slope: 0.10
  }
}


#################### dpn7 ####################
layer {
  name: "dpn7_concat_input"
  type: "Concat"

  bottom: "dpn6_elewise"
  bottom: "dpn6_concat"
  top: "dpn7_concat_input"
}


layer {
  name: "dpn7_conv1"
  type: "Convolution"

  bottom: "dpn7_concat_input"
  top: "dpn7_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn7_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn7_conv1"
  top: "dpn7_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn7_conv1_scale"
  type: "Scale"

  bottom: "dpn7_conv1"
  top: "dpn7_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn7_conv1_relu"
  type: "ReLU"

  bottom: "dpn7_conv1"
  top: "dpn7_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn7_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn7_conv1"
  top: "dpn7_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn7_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn7_conv1"
  top: "dpn7_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn7_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn7_conv2"
  top: "dpn7_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn7_conv2_scale"
  type: "Scale"

  bottom: "dpn7_conv2"
  top: "dpn7_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 1.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn7_conv3"
  type: "Convolution"

  bottom: "dpn7_conv2"
  top: "dpn7_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn7_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn7_conv3"
  top: "dpn7_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn7_conv3_scale"
  type: "Scale"

  bottom: "dpn7_conv3"
  top: "dpn7_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn7_conv3_Slice"
  type: "Slice"

  bottom: "dpn7_conv3"
  top: "dpn7_conv3_split1"  # 0~255
  top: "dpn7_conv3_split2"  # 256~271

  slice_param {
    axis: 1
    slice_point: 256
  }
}


layer {
  name: "dpn7_elewise"
  type: "Eltwise"

  bottom: "dpn6_elewise"
  bottom: "dpn7_conv3_split1"
  top: "dpn7_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn7_elewise_relu"
  type: "ReLU"

  bottom: "dpn7_elewise"
  top: "dpn7_elewise"

  relu_param {
    negative_slope: 0.10
  }
}

layer {
  name: "dpn7_concat"
  type: "Concat"

  bottom: "dpn6_concat"
  bottom: "dpn7_conv3_split2"
  top: "dpn7_concat"
}
layer {
  name: "dpn7_concat_relu"
  type: "ReLU"

  bottom: "dpn7_concat"
  top: "dpn7_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn8 ####################
layer {
  name: "dpn8_concat_input"
  type: "Concat"

  bottom: "dpn7_elewise"
  bottom: "dpn7_concat"
  top: "dpn8_concat_input"
}


layer {
  name: "dpn8_conv1"
  type: "Convolution"

  bottom: "dpn8_concat_input"
  top: "dpn8_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn8_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn8_conv1"
  top: "dpn8_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn8_conv1_scale"
  type: "Scale"

  bottom: "dpn8_conv1"
  top: "dpn8_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn8_conv1_relu"
  type: "ReLU"

  bottom: "dpn8_conv1"
  top: "dpn8_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn8_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn8_conv1"
  top: "dpn8_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn8_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn8_conv1"
  top: "dpn8_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn8_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn8_conv2"
  top: "dpn8_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn8_conv2_scale"
  type: "Scale"

  bottom: "dpn8_conv2"
  top: "dpn8_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn8_conv3"
  type: "Convolution"

  bottom: "dpn8_conv2"
  top: "dpn8_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn8_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn8_conv3"
  top: "dpn8_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn8_conv3_scale"
  type: "Scale"

  bottom: "dpn8_conv3"
  top: "dpn8_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn8_conv3_Slice"
  type: "Slice"

  bottom: "dpn8_conv3"
  top: "dpn8_conv3_split1"  # 0~255
  top: "dpn8_conv3_split2"  # 256~271

  slice_param {
    axis: 1
    slice_point: 256
  }
}


layer {
  name: "dpn8_elewise"
  type: "Eltwise"

  bottom: "dpn7_elewise"
  bottom: "dpn8_conv3_split1"
  top: "dpn8_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn8_elewise_relu"
  type: "ReLU"

  bottom: "dpn8_elewise"
  top: "dpn8_elewise"

  relu_param {
    negative_slope: 0.10
  }
}


layer {
  name: "dpn8_concat"
  type: "Concat"

  bottom: "dpn7_concat"
  bottom: "dpn8_conv3_split2"
  top: "dpn8_concat"
}
layer {
  name: "dpn8_concat_relu"
  type: "ReLU"

  bottom: "dpn8_concat"
  top: "dpn8_concat"

  relu_param {
    negative_slope: 0.10
  }
}


#################### dpn9 ####################
layer {
  name: "dpn9_concat_input"
  type: "Concat"

  bottom: "dpn8_elewise"
  bottom: "dpn8_concat"
  top: "dpn9_concat_input"
}


layer {
  name: "dpn9_conv1"
  type: "Convolution"

  bottom: "dpn9_concat_input"
  top: "dpn9_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn9_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn9_conv1"
  top: "dpn9_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn9_conv1_scale"
  type: "Scale"

  bottom: "dpn9_conv1"
  top: "dpn9_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn9_conv1_relu"
  type: "ReLU"

  bottom: "dpn9_conv1"
  top: "dpn9_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn9_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn9_conv1"
  top: "dpn9_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn9_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn9_conv1"
  top: "dpn9_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn9_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn9_conv2"
  top: "dpn9_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn9_conv2_scale"
  type: "Scale"

  bottom: "dpn9_conv2"
  top: "dpn9_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn9_conv3"
  type: "Convolution"

  bottom: "dpn9_conv2"
  top: "dpn9_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn9_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn9_conv3"
  top: "dpn9_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn9_conv3_scale"
  type: "Scale"

  bottom: "dpn9_conv3"
  top: "dpn9_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn9_conv3_Slice"
  type: "Slice"

  bottom: "dpn9_conv3"
  top: "dpn9_conv3_split1"  # 0~255
  top: "dpn9_conv3_split2"  # 256~272

  slice_param {
    axis: 1
    slice_point: 256
  }
}


layer {
  name: "dpn9_elewise"
  type: "Eltwise"

  bottom: "dpn8_elewise"
  bottom: "dpn9_conv3_split1"
  top: "dpn9_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn9_elewise_relu"
  type: "ReLU"

  bottom: "dpn9_elewise"
  top: "dpn9_elewise"

  relu_param {
    negative_slope: 0.10
  }
}

layer {
  name: "dpn9_concat"
  type: "Concat"

  bottom: "dpn8_concat"
  bottom: "dpn9_conv3_split2"
  top: "dpn9_concat"
}
layer {
  name: "dpn9_concat_relu"
  type: "ReLU"

  bottom: "dpn9_concat"
  top: "dpn9_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn10 ####################
layer {
  name: "dpn10_concat_input"
  type: "Concat"

  bottom: "dpn9_elewise"
  bottom: "dpn9_concat"
  top: "dpn10_concat_input"
}


layer {
  name: "dpn10_conv1"
  type: "Convolution"

  bottom: "dpn10_concat_input"
  top: "dpn10_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn10_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn10_conv1"
  top: "dpn10_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn10_conv1_scale"
  type: "Scale"

  bottom: "dpn10_conv1"
  top: "dpn10_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn10_conv1_relu"
  type: "ReLU"

  bottom: "dpn10_conv1"
  top: "dpn10_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn10_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn10_conv1"
  top: "dpn10_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn10_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn10_conv1"
  top: "dpn10_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn10_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn10_conv2"
  top: "dpn10_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn10_conv2_scale"
  type: "Scale"

  bottom: "dpn10_conv2"
  top: "dpn10_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn10_conv3"
  type: "Convolution"

  bottom: "dpn10_conv2"
  top: "dpn10_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn10_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn10_conv3"
  top: "dpn10_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn10_conv3_scale"
  type: "Scale"

  bottom: "dpn10_conv3"
  top: "dpn10_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn10_conv3_Slice"
  type: "Slice"

  bottom: "dpn10_conv3"
  top: "dpn10_conv3_split1"  # 0~255
  top: "dpn10_conv3_split2"  # 256~272

  slice_param {
    axis: 1
    slice_point: 256
  }
}

layer {
  name: "dpn10_elewise"
  type: "Eltwise"

  bottom: "dpn9_elewise"
  bottom: "dpn10_conv3_split1"
  top: "dpn10_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn10_elewise_relu"
  type: "ReLU"

  bottom: "dpn10_elewise"
  top: "dpn10_elewise"

  relu_param {
    negative_slope: 0.10
  }
}

layer {
  name: "dpn10_concat"
  type: "Concat"

  bottom: "dpn9_concat"
  bottom: "dpn10_conv3_split2"
  top: "dpn10_concat"
}
layer {
  name: "dpn10_concat_relu"
  type: "ReLU"

  bottom: "dpn10_concat"
  top: "dpn10_concat"

  relu_param {
    negative_slope: 0.10
  }
}

#################### dpn11 ####################
layer {
  name: "dpn11_concat_input"
  type: "Concat"

  bottom: "dpn10_elewise"
  bottom: "dpn10_concat"
  top: "dpn11_concat_input"
}


layer {
  name: "dpn11_conv1"
  type: "Convolution"

  bottom: "dpn11_concat_input"
  top: "dpn11_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn11_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn11_conv1"
  top: "dpn11_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn11_conv1_scale"
  type: "Scale"

  bottom: "dpn11_conv1"
  top: "dpn11_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn11_conv1_relu"
  type: "ReLU"

  bottom: "dpn11_conv1"
  top: "dpn11_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn11_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn11_conv1"
  top: "dpn11_conv1"

  shuffle_channel_param {
    group: 8
  }
}
# ------------------------- Channel Shuffle End

layer {
  name: "dpn11_conv2"
  type: "ConvolutionDepthwise"

  bottom: "dpn11_conv1"
  top: "dpn11_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 3
    pad: 1
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    bias_term: false
  }
}
layer {
  name: "dpn11_conv2_bn"
  type: "BatchNorm"

  bottom: "dpn11_conv2"
  top: "dpn11_conv2"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn11_conv2_scale"
  type: "Scale"

  bottom: "dpn11_conv2"
  top: "dpn11_conv2"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}

layer {
  name: "dpn11_conv3"
  type: "Convolution"

  bottom: "dpn11_conv2"
  top: "dpn11_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 272

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn11_conv3_bn"
  type: "BatchNorm"

  bottom: "dpn11_conv3"
  top: "dpn11_conv3"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn11_conv3_scale"
  type: "Scale"

  bottom: "dpn11_conv3"
  top: "dpn11_conv3"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}


layer {
  name: "dpn11_conv3_Slice"
  type: "Slice"

  bottom: "dpn11_conv3"
  top: "dpn11_conv3_split1"  # 0~255
  top: "dpn11_conv3_split2"  # 256~271

  slice_param {
    axis: 1
    slice_point: 256
  }
}

layer {
  name: "dpn11_elewise"
  type: "Eltwise"

  bottom: "dpn10_elewise"
  bottom: "dpn11_conv3_split1"
  top: "dpn11_elewise"

  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "dpn11_elewise_relu"
  type: "ReLU"

  bottom: "dpn11_elewise"
  top: "dpn11_elewise"

  relu_param {
    negative_slope: 0.10
  }
}


layer {
  name: "dpn11_concat"
  type: "Concat"

  bottom: "dpn10_concat"
  bottom: "dpn11_conv3_split2"
  top: "dpn11_concat"
}
layer {
  name: "dpn11_concat_relu"
  type: "ReLU"

  bottom: "dpn11_concat"
  top: "dpn11_concat"

  relu_param {
    negative_slope: 0.10
  }
}


#################### dpn12 ####################
layer {
  name: "dpn12_concat_input"
  type: "Concat"

  bottom: "dpn11_elewise"
  bottom: "dpn11_concat"
  top: "dpn12_concat_input"
}


layer {
  name: "dpn12_conv1"
  type: "Convolution"

  bottom: "dpn12_concat_input"
  top: "dpn12_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }

  convolution_param {
    num_output: 136

    kernel_size: 1
    pad: 0
    stride: 1
    # dilation: 1

    weight_filler {
      type: "msra"
    }

    group: 8
    bias_term: false
  }
}
layer {
  name: "dpn12_conv1_bn"
  type: "BatchNorm"

  bottom: "dpn12_conv1"
  top: "dpn12_conv1"

  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }

  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "dpn12_conv1_scale"
  type: "Scale"

  bottom: "dpn12_conv1"
  top: "dpn12_conv1"

  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }

  scale_param {
    bias_term: true
  }
}
layer {
  name: "dpn12_conv1_relu"
  type: "ReLU"

  bottom: "dpn12_conv1"
  top: "dpn12_conv1"

  relu_param {
    negative_slope: 0.10
  }
}

# ------------------------- Channel Shuffle Start
layer {
  name: "dpn12_shuffle"
  type: "ShuffleChannel"

  bottom: "dpn12_conv1"
